duvallee/drone_transmitter_bt_nrf51822/bt_transmitter/main.c
/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
   uint32_t err_code;
   ble_gap_conn_params_t gap_conn_params;
   ble_gap_conn_sec_mode_t sec_mode;

   BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

   err_code                                              = sd_ble_gap_device_name_set(&sec_mode, (const uint8_t *) DEVICE_NAME, strlen(DEVICE_NAME));
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);

   memset(&gap_conn_params, 0, sizeof(gap_conn_params));

   gap_conn_params.min_conn_interval                     = MIN_CONN_INTERVAL;
   gap_conn_params.max_conn_interval                     = MAX_CONN_INTERVAL;
   gap_conn_params.slave_latency                         = SLAVE_LATENCY;
   gap_conn_params.conn_sup_timeout                      = CONN_SUP_TIMEOUT;

   err_code                                              = sd_ble_gap_ppcp_set(&gap_conn_params);
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_nus    Nordic UART Service structure.
 * @param[in] p_data   Data to be send to UART module.
 * @param[in] length   Length of the data.
 */
/**@snippet [Handling the data received over BLE] */

#if 0
#if defined(DEBUG_OUTPUT_BT_RECEIVED_DATA)
static int test_nus_data_handler_count                   = 0;
#endif
static void nus_data_handler(ble_nus_t * p_nus, uint8_t * p_data, uint16_t length)
{
   int i;

#if defined(DEBUG_OUTPUT_BT_RECEIVED_DATA)
   NRF_LOG_PRINTF("BT Received Data : %d bytes(internal length : %d) \r\n", length, gProject->received_rx_length);

   if ((test_nus_data_handler_count++ % 10) == 0)
   {
      NRF_LOG_PRINTF("BT Received Data : %d bytes(internal length : %d) \r\n", length, gProject->received_rx_length);
   }
#endif

   if (gProject->received_rx_packet_complete != 0)
   {
      return;
   }

   if (length == PROTOCOL_PACKET_BASIC_SIZE)
   {
      // register or alive packet
      for (i = 0; i < PROTOCOL_PACKET_BASIC_SIZE; i++)
      {
         gProject->bt_rx_buffer[i]                       = *(p_data + i);
      }
      gProject->received_rx_length                       = length;
      gProject->received_rx_packet_complete              = 1;
   }
   else if (length == PROTOCOL_PACKET_EXTRA_SIZE)
   {
#if defined(DEBUG_OUTPUT_BT_RECEIVED_DATA)
      NRF_LOG_PRINTF("Channel Data : %d bytes(internal length : %d) \r\n", length, gProject->received_rx_length);
#endif
      if (gProject->received_rx_length > 0)
      {
         // second packet of channel
#if defined(DEBUG_OUTPUT_BT_RECEIVED_DATA)
         NRF_LOG_PRINTF("second 16 bytes \r\n");
#endif
         for (i = 0; i < PROTOCOL_PACKET_EXTRA_SIZE; i++)
         {
            gProject->bt_rx_buffer[PROTOCOL_PACKET_EXTRA_SIZE + i] = *(p_data + i);
#if defined(DEBUG_OUTPUT_BT_RECEIVED_DATA)
            NRF_LOG_HEX(gProject->bt_rx_buffer[PROTOCOL_PACKET_EXTRA_SIZE + i]);
            NRF_LOG_PRINTF("  ");
#endif
         }
#if defined(DEBUG_OUTPUT_BT_RECEIVED_DATA)
         NRF_LOG_PRINTF("\r\n");
#endif
         gProject->received_rx_length                    += length;
         gProject->received_rx_packet_complete           = 1;
#if defined(DEBUG_OUTPUT_BT_RECEIVED_DATA)
         NRF_LOG_PRINTF("complete packet of channel ");
#endif
      }
      else
      {
         // first packet of channel
#if defined(DEBUG_OUTPUT_BT_RECEIVED_DATA)
         NRF_LOG_PRINTF("first 16 bytes \r\n");
#endif
         for (i = 0; i < PROTOCOL_PACKET_EXTRA_SIZE; i++)
         {
            gProject->bt_rx_buffer[i]                    = *(p_data + i);
#if defined(DEBUG_OUTPUT_BT_RECEIVED_DATA)
            NRF_LOG_HEX(gProject->bt_rx_buffer[i]);
            NRF_LOG_PRINTF("  ");
#endif
         }
#if defined(DEBUG_OUTPUT_BT_RECEIVED_DATA)
         NRF_LOG_PRINTF("\r\n");
#endif
         gProject->received_rx_length                    = length;
#if defined(DEBUG_OUTPUT_BT_RECEIVED_DATA)
         NRF_LOG_PRINTF("first packet of channel ");
#endif
      }
   }
   else
   {
#if defined(DEBUG_RTT_ERROR)
      NRF_LOG_PRINTF("[%s-%d] wrong packet size (%d) \r\n", __FUNCTION__, __LINE__, length);
#endif
   }

#if 0
   gProject->received_rx_length                       = (length > PROTOCOL_CHANNEL_MAX_SIZE) ? (PROTOCOL_CHANNEL_MAX_SIZE) : (length);

   for (i = 0; i < gProject->received_rx_length; i++)
   {
      gProject->bt_rx_buffer[i]                       = *(p_data + i);

#if defined(DEBUG_OUTPUT_BT_RECEIVED_DATA)
      if ((test_nus_data_handler_count++ % 10) == 0)
      {
         NRF_LOG_PRINTF("[0x%02X] ", gProject->bt_rx_buffer[i]);
      }
#endif
   }
#if defined(DEBUG_OUTPUT_BT_RECEIVED_DATA)
   NRF_LOG_PRINTF("\r\n");
#endif
#endif
}
/**@snippet [Handling the data received over BLE] */
#endif


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
   uint32_t err_code;
   ble_nus_init_t nus_init;

   memset(&nus_init, 0, sizeof(nus_init));

   nus_init.data_handler                                 = bt_transmitter_ble_data_handler;
   err_code                                              = ble_nus_init(&m_nus, &nus_init);
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if(p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for handling errors from the Connection Parameters module.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
   APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
   uint32_t err_code;
   ble_conn_params_init_t cp_init;

   memset(&cp_init, 0, sizeof(cp_init));

   cp_init.p_conn_params                                 = NULL;
   cp_init.first_conn_params_update_delay                = FIRST_CONN_PARAMS_UPDATE_DELAY;
   cp_init.next_conn_params_update_delay                 = NEXT_CONN_PARAMS_UPDATE_DELAY;
   cp_init.max_conn_params_update_count                  = MAX_CONN_PARAMS_UPDATE_COUNT;
   cp_init.start_on_notify_cccd_handle                   = BLE_GATT_HANDLE_INVALID;
   cp_init.disconnect_on_fail                            = false;
   cp_init.evt_handler                                   = on_conn_params_evt;
   cp_init.error_handler                                 = conn_params_error_handler;

   err_code                                              = ble_conn_params_init(&cp_init);
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
}


/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
   uint32_t err_code                                     = bsp_indication_set(BSP_INDICATE_IDLE);
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);

