duvallee/drone_transmitter_bt_nrf51822/bt_transmitter/main.c
   // Prepare wakeup buttons.
   err_code                                              = bsp_btn_ble_sleep_mode_prepare();
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);

   // Go to system-off mode (this function will not return; wakeup will cause a reset).
   err_code                                              = sd_power_system_off();
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
   uint32_t err_code;

   switch (ble_adv_evt)
   {
      case BLE_ADV_EVT_FAST:
#if defined(DEBUG_RTT_DEBUG)
         NRF_LOG_PRINTF("[%s-%d] BLE_ADV_EVT_FAST : %d \r\n", __FUNCTION__, __LINE__, BLE_ADV_EVT_FAST);
#endif
         err_code                                        = bsp_indication_set(BSP_INDICATE_ADVERTISING);
         BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
         break;

      case BLE_ADV_EVT_IDLE:
#if defined(DEBUG_RTT_DEBUG)
         NRF_LOG_PRINTF("[%s-%d] BLE_ADV_EVT_IDLE : %d \r\n", __FUNCTION__, __LINE__, BLE_ADV_EVT_IDLE);
#endif
         sleep_mode_enter();
         break;

      default:
#if defined(DEBUG_RTT_DEBUG)
         NRF_LOG_PRINTF("[%s-%d] default : %d \r\n", __FUNCTION__, __LINE__, ble_adv_evt);
#endif
         break;
   }
}


/**@brief Function for the application's SoftDevice event handler.
 *
 * @param[in] p_ble_evt SoftDevice event.
 */
static void on_ble_evt(ble_evt_t * p_ble_evt)
{
   uint32_t err_code;

   switch (p_ble_evt->header.evt_id)
   {
      case BLE_GAP_EVT_CONNECTED:
#if defined(DEBUG_RTT_DEBUG)
         NRF_LOG_PRINTF("[%s-%d] BLE Connected !!! : %d \r\n", __FUNCTION__, __LINE__, BLE_GAP_EVT_CONNECTED);
#endif
         break;

      case BLE_GAP_EVT_DISCONNECTED:
#if defined(DEBUG_RTT_DEBUG)
         NRF_LOG_PRINTF("[%s-%d] BLE Disconnected !!! : %d \r\n", __FUNCTION__, __LINE__, BLE_GAP_EVT_DISCONNECTED);
#endif
         break;

      case BLE_GAP_EVT_CONN_PARAM_UPDATE :
#if defined(DEBUG_RTT_DEBUG)
         NRF_LOG_PRINTF("[%s-%d] BLE Param Update !!! : %d \r\n", __FUNCTION__, __LINE__, BLE_GAP_EVT_CONN_PARAM_UPDATE);
#endif
         break;

      case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
         // Pairing not supported
         err_code                                        = sd_ble_gap_sec_params_reply(m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
         BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
#if defined(DEBUG_RTT_DEBUG)
         NRF_LOG_PRINTF("[%s-%d] BLE BLE_GAP_EVT_SEC_PARAMS_REQUEST !!! : %d  \r\n", __FUNCTION__, __LINE__, BLE_GAP_EVT_SEC_PARAMS_REQUEST);
#endif
         break;

      case BLE_GATTS_EVT_SYS_ATTR_MISSING:
         // No system attributes have been stored.
         err_code                                        = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
         BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
#if defined(DEBUG_RTT_DEBUG)
         NRF_LOG_PRINTF("[%s-%d] BLE_GATTS_EVT_SYS_ATTR_MISSING !!! : %d  \r\n", __FUNCTION__, __LINE__, BLE_GATTS_EVT_SYS_ATTR_MISSING);
#endif
         break;

      case BLE_GATTS_EVT_WRITE :
#if defined(DEBUG_RTT_DEBUG)
         NRF_LOG_PRINTF("[%s-%d] GATTS EVT WRITE !!! : %d \r\n", __FUNCTION__, __LINE__, BLE_GATTS_EVT_WRITE);
#endif
         break;

      default:
#if defined(DEBUG_RTT_DEBUG)
         NRF_LOG_PRINTF("[%s-%d] default : %d \r\n", __FUNCTION__, __LINE__, p_ble_evt->header.evt_id);
#endif
         break;
   }
}


/**@brief Function for dispatching a SoftDevice event to all modules with a SoftDevice
 *        event handler.
 *
 * @details This function is called from the SoftDevice event interrupt handler after a
 *          SoftDevice event has been received.
 *
 * @param[in] p_ble_evt  SoftDevice event.
 */
static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
   ble_conn_params_on_ble_evt(p_ble_evt);
   ble_nus_on_ble_evt(&m_nus, p_ble_evt);
   on_ble_evt(p_ble_evt);
   ble_advertising_on_ble_evt(p_ble_evt);
   bsp_btn_ble_on_ble_evt(p_ble_evt);
}


/**@brief Function for the SoftDevice initialization.
 *
 * @details This function initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
   uint32_t err_code;

   nrf_clock_lf_cfg_t clock_lf_cfg                       = NRF_CLOCK_LFCLKSRC;

   // Initialize SoftDevice.
   SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL);

   ble_enable_params_t ble_enable_params;
   err_code                                              = softdevice_enable_get_default_config(CENTRAL_LINK_COUNT, PERIPHERAL_LINK_COUNT, &ble_enable_params);
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);

   //Check the ram settings against the used number of links
   CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT,PERIPHERAL_LINK_COUNT);
   // Enable BLE stack.
   err_code                                              = softdevice_enable(&ble_enable_params);
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);

   // Subscribe for BLE events.
   err_code                                              = softdevice_ble_evt_handler_set(ble_evt_dispatch);
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
   uint32_t err_code;
   switch (event)
   {
      case BSP_EVENT_SLEEP :
         sleep_mode_enter();
         break;

      case BSP_EVENT_DISCONNECT :
         err_code                                        = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
         if (err_code != NRF_ERROR_INVALID_STATE)
         {
            BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
         }
         break;

      case BSP_EVENT_WHITELIST_OFF :
#if defined(DEBUG_RTT_ERROR)
         NRF_LOG_PRINTF("[%s-%d] event : BSP_EVENT_WHITELIST_OFF \r\n", __FUNCTION__, __LINE__);
#endif
         err_code                                        = ble_advertising_restart_without_whitelist();
         if (err_code != NRF_ERROR_INVALID_STATE)
         {
            BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
         }
         break;

      default:
         break;
   }
}


