duvallee/drone_transmitter_bt_nrf51822/bt_transmitter/main.c
/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to
 *          a string. The string will be be sent over BLE when the last character received was a
 *          'new line' i.e '\n' (hex 0x0D) or if the string has reached a length of
 *          @ref NUS_MAX_DATA_LENGTH.
 */
/**@snippet [Handling the data received over UART] */
void uart_event_handle(app_uart_evt_t* p_event)
{
   static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
   static uint8_t index                                  = 0;
   uint32_t err_code                                     = 0;

   switch (p_event->evt_type)
   {
      case APP_UART_DATA_READY :
#if 1
         {
            UNUSED_VARIABLE(err_code);
            index                                        = 0;
            while (app_uart_get(&data_array[index]) == NRF_SUCCESS)
            {
               if (index >= BLE_NUS_MAX_DATA_LEN)
               {
                  break;
               }
               index++;
            }
            if (index != 0)
            {
               err_code                                  = ble_nus_string_send(&m_nus, data_array, index);
               if (err_code != NRF_ERROR_INVALID_STATE)
               {
                  BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
               }
            }
         }
#else
            UNUSED_VARIABLE(app_uart_get(&data_array[index]));
            index++;

            if ((data_array[index - 1] == '\n') || (index >= (BLE_NUS_MAX_DATA_LEN)))
            {
                err_code = ble_nus_string_send(&m_nus, data_array, index);
                if (err_code != NRF_ERROR_INVALID_STATE)
                {
                    APP_ERROR_CHECK(err_code);
                }

                index = 0;
#endif
         break;

      case APP_UART_COMMUNICATION_ERROR :
         APP_ERROR_HANDLER(p_event->data.error_communication);
         break;

      case APP_UART_FIFO_ERROR :
         APP_ERROR_HANDLER(p_event->data.error_code);
         break;

      default:
         break;
   }
}
/**@snippet [Handling the data received over UART] */


/******************************************************************
 *
 * Function Name : uart_init
 *
 *
 ******************************************************************/
/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init(void)
{
   uint32_t err_code                                     = 0;
   const app_uart_comm_params_t comm_params              =
   {
      RX_PIN_NUMBER,
      TX_PIN_NUMBER,
      RTS_PIN_NUMBER,
      CTS_PIN_NUMBER,
      APP_UART_FLOW_CONTROL_DISABLED,
      false,
      UART_BAUDRATE_BAUDRATE_Baud115200
   };

   APP_UART_FIFO_INIT(&comm_params, UART_RX_BUF_SIZE, UART_TX_BUF_SIZE, uart_event_handle, APP_IRQ_PRIORITY_LOW, err_code);
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
   uint32_t err_code;
   ble_advdata_t advdata;
   ble_advdata_t scanrsp;

   // Build advertising data struct to pass into @ref ble_advertising_init.
   memset(&advdata, 0, sizeof(advdata));
   advdata.name_type                                     = BLE_ADVDATA_FULL_NAME;
   advdata.include_appearance                            = false;
   advdata.flags                                         = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

   memset(&scanrsp, 0, sizeof(scanrsp));
   scanrsp.uuids_complete.uuid_cnt                       = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
   scanrsp.uuids_complete.p_uuids                        = m_adv_uuids;

   ble_adv_modes_config_t options                        = {0};
   options.ble_adv_fast_enabled                          = BLE_ADV_FAST_ENABLED;
   options.ble_adv_fast_interval                         = APP_ADV_INTERVAL;
   options.ble_adv_fast_timeout                          = APP_ADV_TIMEOUT_IN_SECONDS;

   err_code                                              = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
   bsp_event_t startup_event;

   uint32_t err_code                                     = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS, APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), bsp_event_handler);
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);

   err_code                                              = bsp_btn_ble_init(NULL, &startup_event);
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
   *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
   uint32_t err_code                                     = sd_app_evt_wait();

#if defined(DEBUG_RTT_ERROR)
   if (err_code != NRF_SUCCESS)
   {
      NRF_LOG_PRINTF("[%s-%d] error handler : %d \r\n", __FUNCTION__, __LINE__, err_code);
   }
#endif

    BT_TRANSMITTER_APP_ERROR_CHECK(err_code);
}

/******************************************************************
 *
 * Function Name : system_idle_timer
 *
 *
 ******************************************************************/
void system_idle_timer(void* pArg)
{
   NRF_LOG_PRINTF("[%s-%d] system running time %d.%d sec  \r\n", __FUNCTION__, __LINE__, g_bt_Project->system_time.second, g_bt_Project->system_time.milli_second);
}

/**@brief Application main function.
 */
int main(void)
{
   uint32_t err_code;
   bool erase_bonds;

   memset(g_bt_Project, 0, sizeof(g_bt_Project));

   // Initialize.
   APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
   APP_TIMER_DEF(bt_transmitter_timer);

   uart_init();

   buttons_leds_init(&erase_bonds);
   ble_stack_init();
   gap_params_init();
   services_init();
   advertising_init();
   conn_params_init();

#if defined(DEBUG_GPIO_PIN)
   nrf_gpio_cfg_output(DEBUG_GPIO_PIN);
   nrf_gpio_pin_write(DEBUG_GPIO_PIN, 0);
#endif

   BT_TRANSMITTER_APP_ERROR_CHECK(NRF_LOG_INIT());

   err_code                                              = ble_advertising_start(BLE_ADV_MODE_FAST);
   if (err_code != NRF_SUCCESS)
   {
#if defined(DEBUG_RTT_ERROR)
      NRF_LOG_PRINTF("[%s-%d] ble_advertising_start() failed : %d \r\n", __FUNCTION__, __LINE__, (int) err_code);
#endif
   }
   BT_TRANSMITTER_APP_ERROR_CHECK(err_code);


   if (app_timer_create(&bt_transmitter_timer, APP_TIMER_MODE_REPEATED, bt_transmitter_timer_handler) != NRF_SUCCESS)
   {
#if defined(DEBUG_RTT_ERROR)
      NRF_LOG_PRINTF("[%s-%d] Can't create app timer \r\n", __FUNCTION__, __LINE__);
#endif
   }

   if (app_timer_start(bt_transmitter_timer, APP_TIMER_TICKS(1, APP_TIMER_PRESCALER), NULL) != NRF_SUCCESS)
   {
#if defined(DEBUG_RTT_ERROR)
      NRF_LOG_PRINTF("[%s-%d] Can't create app timer \r\n", __FUNCTION__, __LINE__);
#endif
   }

   g_bt_Project->update_channel_data_for_fc.channel_num  = 0;
   g_bt_Project->update_channel_data_for_fc.channel_update = 0;
   g_bt_Project->update_channel_data_for_fc.send_uart_fn = send_msg_to_fc_controller;
   fc_serial_rx_init(&(g_bt_Project->update_channel_data_for_fc));

//   add_timer(system_idle_timer, 5000, -1, (void*) NULL);
   add_timer(system_idle_timer, 60000, -1, (void*) NULL);

   NRF_LOG_PRINTF("=============================================================  \r\n");
   NRF_LOG_PRINTF("Drone Remote Controller Start !!!  \r\n");
   NRF_LOG_PRINTF("Build : compiled %s %s  \r\n", __DATE__, __TIME__);
   NRF_LOG_PRINTF("=============================================================  \r\n");

   // Enter main loop.
   for (;;)
   {
      power_manage();
   }
}


/**
 * @}
 */
